data/input/of_base_case/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0]; 	// [kg m s ... ]

internalField   uniform (0 0 0);

boundaryField
{

inlet
{
  type uniformFixedValue;
  uniformValue table
  (  (0.0236 (0.0001 0.0014 0.0000))
  (0.0359 (0.0011 0.0205 0.0000))
  (0.0449 (0.0032 0.0574 0.0000))
  (0.0504 (0.0050 0.0900 0.0000))
  (0.0544 (0.0065 0.1168 0.0000))
  (0.0577 (0.0082 0.1482 0.0000))
  (0.0601 (0.0096 0.1730 0.0000))
  (0.0644 (0.0110 0.1987 0.0000))
  (0.0671 (0.0125 0.2253 0.0000))
  (0.0729 (0.0143 0.2570 0.0000))
  (0.0816 (0.0160 0.2875 0.0000))
  (0.0886 (0.0176 0.3174 0.0000))
  (0.0946 (0.0190 0.3430 0.0000))
  (0.1018 (0.0206 0.3720 0.0000))
  (0.1090 (0.0221 0.3976 0.0000))
  (0.1184 (0.0235 0.4238 0.0000))
  (0.1375 (0.0250 0.4500 0.0000))
  (0.1673 (0.0242 0.4354 0.0000))
  (0.1800 (0.0232 0.4184 0.0000))
  (0.1945 (0.0220 0.3960 0.0000))
  (0.2077 (0.0206 0.3718 0.0000))
  (0.2186 (0.0194 0.3499 0.0000))
  (0.2282 (0.0182 0.3287 0.0000))
  (0.2378 (0.0170 0.3069 0.0000))
  (0.2477 (0.0154 0.2779 0.0000))
  (0.2631 (0.0137 0.2467 0.0000))
  (0.2701 (0.0125 0.2254 0.0000))
  (0.2817 (0.0108 0.1947 0.0000))
  (0.2920 (0.0091 0.1639 0.0000))
  (0.2992 (0.0075 0.1358 0.0000))
  (0.3064 (0.0060 0.1086 0.0000))
  (0.3137 (0.0045 0.0805 0.0000))
  (0.3209 (0.0029 0.0530 0.0000))
  (0.3269 (0.0017 0.0313 0.0000))
  (0.3373 (0.0001 0.0020 0.0000))
  (0.3474 (-0.0019 -0.0347 -0.0000))
  (0.3546 (-0.0032 -0.0576 -0.0000))
  (0.3618 (-0.0045 -0.0808 -0.0000))
  (0.3702 (-0.0059 -0.1068 -0.0000))
  (0.3816 (-0.0073 -0.1320 -0.0000))
  (0.3989 (-0.0084 -0.1515 -0.0000))
  (0.4316 (-0.0080 -0.1438 -0.0000))
  (0.4594 (-0.0073 -0.1311 -0.0000))
  (0.4822 (-0.0064 -0.1150 -0.0000))
  (0.5075 (-0.0052 -0.0946 -0.0000))
  (0.5303 (-0.0041 -0.0742 -0.0000))
  (0.5532 (-0.0030 -0.0532 -0.0000))
  (0.5785 (-0.0017 -0.0311 -0.0000))
  (0.6050 (-0.0005 -0.0095 -0.0000))
  (0.6275 (0.0004 0.0069 0.0000))
  (0.6580 (0.0013 0.0238 0.0000))
  (0.6854 (0.0016 0.0285 0.0000))
  (0.7109 (0.0015 0.0267 0.0000))
  (0.7374 (0.0014 0.0255 0.0000))
  (0.7639 (0.0012 0.0212 0.0000))
  (0.7904 (0.0009 0.0161 0.0000))
  (0.8169 (0.0006 0.0099 0.0000))
  (0.8482 (0.0002 0.0034 0.0000))
  (0.8746 (-0.0002 -0.0028 -0.0000))
  (0.9011 (-0.0002 -0.0043 -0.0000))
  (0.9276 (-0.0002 -0.0044 -0.0000))
  (0.9513 (0.0001 0.0014 0.0000))
  );
}

outlet
{
    type        inletOutlet;
    inletValue  uniform (0 0 0);
    value       $internalField;
}

wall
{
type        noSlip;
} 

}

// ************************************************************************* //